configuration.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-07 Sat 12:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Donald Brady" />


</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration</h1>

<div id="outline-container-org0783fbc" class="outline-2">
<h2 id="org0783fbc">Configure <code>use-package</code></h2>
<div class="outline-text-2" id="text-org0783fbc">
<p>
This setup borrows heavily from the fantastic Org Mode talk here: <a href="https://www.youtube.com/watch?v=SzA2YODtgK4">Great Org Mode Talk</a>
by Harry Schwartz.
</p>

<p>
Use <code>use-package</code> to install and configure packages. My <code>init.el</code> includes
the initial setup for <code>package.el</code> and ensures that <code>use-package</code> is installed.
</p>

<p>
This makes sure that <code>use-package</code> will install the package if it&rsquo;s not already
available. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #8470ff; font-weight: bold;">use-package-ensure</span>)
(<span style="color: #00ffff;">setq</span> use-package-always-ensure t)
</pre>
</div>

<p>
Always compile packages, and use the newest version available.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">auto-compile</span>
  <span style="color: #b0c4de;">:config</span> (auto-compile-on-load-mode))

(<span style="color: #00ffff;">setq</span> load-prefer-newer t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9998322" class="outline-2">
<h2 id="org9998322">Personal Details Setup</h2>
<div class="outline-text-2" id="text-org9998322">
<p>
Sets up some personal information sucha as email
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff;">setq</span> user-full-name <span style="color: #ffc1c1;">"Donald Brady"</span> user-mail-address <span style="color: #ffc1c1;">"donaldbrady@gmail.com"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org58a0c6d" class="outline-2">
<h2 id="org58a0c6d">Set up savefile, backup, and autosave directories</h2>
<div class="outline-text-2" id="text-org58a0c6d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff;">defconst</span> <span style="color: #7fffd4;">dbrady-savefile-dir</span> (expand-file-name <span style="color: #ffc1c1;">"savefile"</span> user-emacs-directory))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">create the savefile dir if it doesn't exist</span>
(<span style="color: #00ffff;">unless</span> (file-exists-p dbrady-savefile-dir) (make-directory dbrady-savefile-dir))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">store all backup and autosave files in the tmp dir</span>
(<span style="color: #00ffff;">setq</span> backup-directory-alist `((<span style="color: #ffc1c1;">".*"</span> . ,temporary-file-directory)))
(<span style="color: #00ffff;">setq</span> auto-save-file-name-transforms `((<span style="color: #ffc1c1;">".*"</span> ,temporary-file-directory t)))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">saveplace remembers your location in a file when saving files</span>
(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">saveplace</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> save-place-file (expand-file-name <span style="color: #ffc1c1;">"saveplace"</span> dbrady-savefile-dir))
  <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">activate it for all buffers</span>
  (<span style="color: #00ffff;">setq-default</span> save-place t))

(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">savehist</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> savehist-additional-variables
  <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">search entries</span>
  '(search-ring regexp-search-ring)
  <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">save every minute</span>
  savehist-autosave-interval 60
  <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">keep the home clean</span>
  savehist-file (expand-file-name <span style="color: #ffc1c1;">"savehist"</span> dbrady-savefile-dir))
  (savehist-mode +1))

</pre>
</div>
</div>
</div>

<div id="outline-container-org9627250" class="outline-2">
<h2 id="org9627250">Basic Configurations</h2>
<div class="outline-text-2" id="text-org9627250">
<p>
Place for a grab bag of basic settings
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff;">setq</span> inhibit-startup-screen t)
(<span style="color: #00ffff;">when</span> (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(<span style="color: #00ffff;">setq</span> ring-bell-function 'ignore)
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)
(fset 'yes-or-no-p 'y-or-n-p)
(<span style="color: #00ffff;">setq</span> require-final-newline t)
(<span style="color: #00ffff;">setq-default</span> fill-column 100)
(add-hook 'text-mode-hook 'auto-fill-mode)
(add-hook 'org-mode-hook 'auto-fill-mode)
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(<span style="color: #00ffff;">setq-default</span> indent-tabs-mode nil)   
(<span style="color: #00ffff;">setq-default</span> tab-width 4)            
<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">smart tab behavior - indent or complete</span>
(<span style="color: #00ffff;">setq</span> tab-always-indent 'complete)


</pre>
</div>
</div>
</div>

<div id="outline-container-org9ae7581" class="outline-2">
<h2 id="org9ae7581">Flyspell / hunspell Configuration</h2>
<div class="outline-text-2" id="text-org9ae7581">
</div>
<div id="outline-container-org3d13c70" class="outline-3">
<h3 id="org3d13c70">Install hunspell in msys2.</h3>
<div class="outline-text-3" id="text-org3d13c70">
<p>
Install <a href="https://www.msys2.org/">msys2</a>. Install the developer packages and git:
</p>

<p>
<code>pacman -S --needed base-devel msys2-devel</code>
</p>

<p>
This involves downloading and building hunspell from the its <a href="https://github.com/hunspell/hunspell">repo</a>. This does not come with
dictionaries which need to be downloaded from the LibreOffice site and placed in:
</p>

<p>
<code>/usr/share/hunspell</code> 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff;">setq</span> ispell-program-name (executable-find <span style="color: #ffc1c1;">"hunspell"</span>))
(<span style="color: #00ffff;">setq</span> ispell-hunspell-dict-paths-alist '((<span style="color: #ffc1c1;">"en_US"</span> <span style="color: #ffc1c1;">"C:/msys64/usr/share/hunspell/en_US.aff"</span>)))
(<span style="color: #00ffff;">setq</span> ispell-local-dictionary <span style="color: #ffc1c1;">"en_US"</span>)
(<span style="color: #00ffff;">setq</span> ispell-local-dictionary-alist '((<span style="color: #ffc1c1;">"en_US"</span> <span style="color: #ffc1c1;">"[[:alpha:]]"</span> <span style="color: #ffc1c1;">"[</span><span style="color: #ffc1c1;">^</span><span style="color: #ffc1c1;">[:alpha:]]"</span> <span style="color: #ffc1c1;">"[']"</span> nil (<span style="color: #ffc1c1;">"-d"</span> <span style="color: #ffc1c1;">"en_US"</span>) nil utf-8)))
(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">flyspell</span>
  <span style="color: #b0c4de;">:config</span>
  (add-hook 'text-mode-hook 'flyspell-mode)
  (add-hook 'gfm-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'git-commit-mode-hook 'flyspell-mode)
  (add-hook 'mu4e-compose-mode-hook 'flyspell-mode))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5eb17ab" class="outline-2">
<h2 id="org5eb17ab">Hippie Expand Setup</h2>
<div class="outline-text-2" id="text-org5eb17ab">
<p>
This is a more powerful completion system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">hippie expand is dabbrev expand on steroids</span>
(<span style="color: #00ffff;">setq</span> hippie-expand-try-functions-list '(try-expand-dabbrev
                                         try-expand-dabbrev-all-buffers
                                         try-expand-dabbrev-from-kill
                                         try-complete-file-name-partially
                                         try-complete-file-name
                                         try-expand-all-abbrevs
                                         try-expand-list
                                         try-expand-line
                                         try-complete-lisp-symbol-partially
                                         try-complete-lisp-symbol))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">use hippie-expand instead of dabbrev</span>
(global-set-key (kbd <span style="color: #ffc1c1;">"M-/"</span>) #'hippie-expand)
(global-set-key (kbd <span style="color: #ffc1c1;">"s-/"</span>) #'hippie-expand)

</pre>
</div>
</div>
</div>

<div id="outline-container-org489638a" class="outline-2">
<h2 id="org489638a">Configure Built-in Packages</h2>
<div class="outline-text-2" id="text-org489638a">
<p>
Configuration for a bunch of built in packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">paren</span>
  <span style="color: #b0c4de;">:config</span>
  (show-paren-mode +1))

(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">elec-pair</span>
  <span style="color: #b0c4de;">:config</span>
  (electric-pair-mode +1))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">(use-package abbrev</span>
<span style="color: #fa8072;">;;   </span><span style="color: #ff7f24; font-style: italic;">:config</span>
<span style="color: #fa8072;">;;   </span><span style="color: #ff7f24; font-style: italic;">(setq save-abbrevs 'silently)</span>
<span style="color: #fa8072;">;;   </span><span style="color: #ff7f24; font-style: italic;">(setq-default abbrev-mode t))</span>

(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">recentf</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> recentf-save-file (expand-file-name <span style="color: #ffc1c1;">"recentf"</span> dbrady-savefile-dir)
        recentf-max-saved-items 500
        recentf-max-menu-items 15
        <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">disable recentf-cleanup on Emacs start, because it can cause</span>
        <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">problems with remote files</span>
        recentf-auto-cleanup 'never)
  (recentf-mode +1))

(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">ivy</span>
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (ivy-mode 1)
  (<span style="color: #00ffff;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #00ffff;">setq</span> enable-recursive-minibuffers t)
  (global-set-key (kbd <span style="color: #ffc1c1;">"C-c C-r"</span>) 'ivy-resume)
  (global-set-key (kbd <span style="color: #ffc1c1;">"&lt;f6&gt;"</span>) 'ivy-resume))

(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">swiper</span>
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (global-set-key <span style="color: #ffc1c1;">"\C-s"</span> 'swiper))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">binds C-M-= and C-M-- to increase and decrease the face size</span>
(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">default-text-scale</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> default-text-scale-mode t))

<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">config changes made through the customize UI will be stored here</span>
(<span style="color: #00ffff;">setq</span> custom-file (expand-file-name <span style="color: #ffc1c1;">"custom.el"</span> user-emacs-directory))

(<span style="color: #00ffff;">when</span> (file-exists-p custom-file)
  (load custom-file))

</pre>
</div>
</div>
</div>

<div id="outline-container-org85a53e6" class="outline-2">
<h2 id="org85a53e6">Exporting</h2>
<div class="outline-text-2" id="text-org85a53e6">
<p>
Allow <code>babel</code> to evaluate Emacs lisp, Ruby, dot, or Gnuplot code.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">gnuplot</span>)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (ruby . t)
   (dot . t)
   (gnuplot . t)))
</pre>
</div>

<p>
Don&rsquo;t ask before evaluating code blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> org-confirm-babel-evaluate nil)
</pre>
</div>

<p>
Use <code>htmlize</code> to ensure that exported code blocks use syntax highlighting.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #8470ff; font-weight: bold;">htmlize</span>)
</pre>
</div>

<p>
Translate regular ol&rsquo; straight quotes to typographically-correct curly quotes
when exporting.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> org-export-with-smart-quotes t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org037b885" class="outline-2">
<h2 id="org037b885">Globally Set Keys</h2>
<div class="outline-text-2" id="text-org037b885">
<p>
This section has all globally set keys unless they are related to a package or mode config. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">use hippie-expand instead of dabbrev</span>
  (global-set-key (kbd <span style="color: #ffc1c1;">"M-/"</span>) #'hippie-expand)
  (global-set-key (kbd <span style="color: #ffc1c1;">"s-/"</span>) #'hippie-expand)

  <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">keyboard macros</span>
  (global-set-key (kbd <span style="color: #ffc1c1;">"&lt;f1&gt;"</span>) #'start-kbd-macro)
  (global-set-key (kbd <span style="color: #ffc1c1;">"&lt;f2&gt;"</span>) #'end-kbd-macro)
  (global-set-key (kbd <span style="color: #ffc1c1;">"&lt;f3&gt;"</span>) #'call-last-kbd-macro)

  <span style="color: #fa8072;">;; </span><span style="color: #ff7f24; font-style: italic;">replace buffer-menu with ibuffer</span>
  (global-set-key (kbd <span style="color: #ffc1c1;">"C-x C-b"</span>) #'ibuffer)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Donald Brady</p>
<p class="date">Created: 2020-03-07 Sat 12:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
